# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Admin\Desktop\lab-project\Final-Project\Oscilloscope.cydsn\Oscilloscope.cyprj
# Date: Thu, 07 Jun 2018 05:21:36 GMT
#set_units -time ns
create_clock -name {ADC_POT_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {Clock_1(routed)} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_POT_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_CH1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 35} -nominal_period 708.33333333333326 [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {ADC_CH2_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 35} -nominal_period 708.33333333333326 [list [get_pins {ClockBlock/aclk_glb_1}]]
create_generated_clock -name {ADC_POT_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 151 301} [list [get_pins {ClockBlock/aclk_glb_2}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 601 1201} [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Admin\Desktop\lab-project\Final-Project\Oscilloscope.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Admin\Desktop\lab-project\Final-Project\Oscilloscope.cydsn\Oscilloscope.cyprj
# Date: Thu, 07 Jun 2018 05:21:31 GMT
